apache/nuttx/arch/arm/src/imxrt/chip/rt102x/imxrt102x_iomuxc.h
/* Pad Control Registers
 * Pad Control Register Indices (used by software for table lookups)
 */

#define IMXRT_PADCTL_GPIO_EMC_00_INDEX              0
#define IMXRT_PADCTL_GPIO_EMC_01_INDEX              1
#define IMXRT_PADCTL_GPIO_EMC_02_INDEX              2
#define IMXRT_PADCTL_GPIO_EMC_03_INDEX              3
#define IMXRT_PADCTL_GPIO_EMC_04_INDEX              4
#define IMXRT_PADCTL_GPIO_EMC_05_INDEX              5
#define IMXRT_PADCTL_GPIO_EMC_06_INDEX              6
#define IMXRT_PADCTL_GPIO_EMC_07_INDEX              7
#define IMXRT_PADCTL_GPIO_EMC_08_INDEX              8
#define IMXRT_PADCTL_GPIO_EMC_09_INDEX              9
#define IMXRT_PADCTL_GPIO_EMC_10_INDEX              10
#define IMXRT_PADCTL_GPIO_EMC_11_INDEX              11
#define IMXRT_PADCTL_GPIO_EMC_12_INDEX              12
#define IMXRT_PADCTL_GPIO_EMC_13_INDEX              13
#define IMXRT_PADCTL_GPIO_EMC_14_INDEX              14
#define IMXRT_PADCTL_GPIO_EMC_15_INDEX              15
#define IMXRT_PADCTL_GPIO_EMC_16_INDEX              16
#define IMXRT_PADCTL_GPIO_EMC_17_INDEX              17
#define IMXRT_PADCTL_GPIO_EMC_18_INDEX              18
#define IMXRT_PADCTL_GPIO_EMC_19_INDEX              19
#define IMXRT_PADCTL_GPIO_EMC_20_INDEX              20
#define IMXRT_PADCTL_GPIO_EMC_21_INDEX              21
#define IMXRT_PADCTL_GPIO_EMC_22_INDEX              22
#define IMXRT_PADCTL_GPIO_EMC_23_INDEX              23
#define IMXRT_PADCTL_GPIO_EMC_24_INDEX              24
#define IMXRT_PADCTL_GPIO_EMC_25_INDEX              25
#define IMXRT_PADCTL_GPIO_EMC_26_INDEX              26
#define IMXRT_PADCTL_GPIO_EMC_27_INDEX              27
#define IMXRT_PADCTL_GPIO_EMC_28_INDEX              28
#define IMXRT_PADCTL_GPIO_EMC_29_INDEX              29
#define IMXRT_PADCTL_GPIO_EMC_30_INDEX              30
#define IMXRT_PADCTL_GPIO_EMC_31_INDEX              31
#define IMXRT_PADCTL_GPIO_EMC_32_INDEX              32
#define IMXRT_PADCTL_GPIO_EMC_33_INDEX              33
#define IMXRT_PADCTL_GPIO_EMC_34_INDEX              34
#define IMXRT_PADCTL_GPIO_EMC_35_INDEX              35
#define IMXRT_PADCTL_GPIO_EMC_36_INDEX              36
#define IMXRT_PADCTL_GPIO_EMC_37_INDEX              37
#define IMXRT_PADCTL_GPIO_EMC_38_INDEX              38
#define IMXRT_PADCTL_GPIO_EMC_39_INDEX              39
#define IMXRT_PADCTL_GPIO_EMC_40_INDEX              40
#define IMXRT_PADCTL_GPIO_EMC_41_INDEX              41
#define IMXRT_PADCTL_GPIO_AD_B0_00_INDEX            42
#define IMXRT_PADCTL_GPIO_AD_B0_01_INDEX            43
#define IMXRT_PADCTL_GPIO_AD_B0_02_INDEX            44
#define IMXRT_PADCTL_GPIO_AD_B0_03_INDEX            45
#define IMXRT_PADCTL_GPIO_AD_B0_04_INDEX            46
#define IMXRT_PADCTL_GPIO_AD_B0_05_INDEX            47
#define IMXRT_PADCTL_GPIO_AD_B0_06_INDEX            48
#define IMXRT_PADCTL_GPIO_AD_B0_07_INDEX            49
#define IMXRT_PADCTL_GPIO_AD_B0_08_INDEX            50
#define IMXRT_PADCTL_GPIO_AD_B0_09_INDEX            51
#define IMXRT_PADCTL_GPIO_AD_B0_10_INDEX            52
#define IMXRT_PADCTL_GPIO_AD_B0_11_INDEX            53
#define IMXRT_PADCTL_GPIO_AD_B0_12_INDEX            54
#define IMXRT_PADCTL_GPIO_AD_B0_13_INDEX            55
#define IMXRT_PADCTL_GPIO_AD_B0_14_INDEX            56
#define IMXRT_PADCTL_GPIO_AD_B0_15_INDEX            57
#define IMXRT_PADCTL_GPIO_AD_B1_00_INDEX            58
#define IMXRT_PADCTL_GPIO_AD_B1_01_INDEX            59
#define IMXRT_PADCTL_GPIO_AD_B1_02_INDEX            60
#define IMXRT_PADCTL_GPIO_AD_B1_03_INDEX            61
#define IMXRT_PADCTL_GPIO_AD_B1_04_INDEX            62
#define IMXRT_PADCTL_GPIO_AD_B1_05_INDEX            63
#define IMXRT_PADCTL_GPIO_AD_B1_06_INDEX            64
#define IMXRT_PADCTL_GPIO_AD_B1_07_INDEX            65
#define IMXRT_PADCTL_GPIO_AD_B1_08_INDEX            66
#define IMXRT_PADCTL_GPIO_AD_B1_09_INDEX            67
#define IMXRT_PADCTL_GPIO_AD_B1_10_INDEX            68
#define IMXRT_PADCTL_GPIO_AD_B1_11_INDEX            69
#define IMXRT_PADCTL_GPIO_AD_B1_12_INDEX            70
#define IMXRT_PADCTL_GPIO_AD_B1_13_INDEX            71
#define IMXRT_PADCTL_GPIO_AD_B1_14_INDEX            72
#define IMXRT_PADCTL_GPIO_AD_B1_15_INDEX            73
#define IMXRT_PADCTL_GPIO_SD_B0_00_INDEX            74
#define IMXRT_PADCTL_GPIO_SD_B0_01_INDEX            75
#define IMXRT_PADCTL_GPIO_SD_B0_02_INDEX            76
#define IMXRT_PADCTL_GPIO_SD_B0_03_INDEX            77
#define IMXRT_PADCTL_GPIO_SD_B0_04_INDEX            78
#define IMXRT_PADCTL_GPIO_SD_B0_05_INDEX            79
#define IMXRT_PADCTL_GPIO_SD_B0_06_INDEX            80
#define IMXRT_PADCTL_GPIO_SD_B1_00_INDEX            81
#define IMXRT_PADCTL_GPIO_SD_B1_01_INDEX            82
#define IMXRT_PADCTL_GPIO_SD_B1_02_INDEX            83
#define IMXRT_PADCTL_GPIO_SD_B1_03_INDEX            84
#define IMXRT_PADCTL_GPIO_SD_B1_04_INDEX            85
#define IMXRT_PADCTL_GPIO_SD_B1_05_INDEX            86
#define IMXRT_PADCTL_GPIO_SD_B1_06_INDEX            87
#define IMXRT_PADCTL_GPIO_SD_B1_07_INDEX            88
#define IMXRT_PADCTL_GPIO_SD_B1_08_INDEX            89
#define IMXRT_PADCTL_GPIO_SD_B1_09_INDEX            90
#define IMXRT_PADCTL_GPIO_SD_B1_10_INDEX            91
#define IMXRT_PADCTL_GPIO_SD_B1_11_INDEX            92

#define IMXRT_PADCTL_WAKEUP_INDEX                   93
#define IMXRT_PADCTL_PMIC_ON_REQ_INDEX              94
#define IMXRT_PADCTL_PMIC_STBY_REQ_INDEX            95

#define IMXRT_PADCTL_NREGISTERS                     96

/* Pad Control Register Offsets */

#define IMXRT_PADCTL_OFFSET(n)                      (0x0188 + ((unsigned int)(n) << 2))
#define IMXRT_PADCTL_OFFSET_SNVS(n)                 (0x18 + ((unsigned int)(n-IMXRT_PADCTL_WAKEUP_INDEX) << 2))

#define IMXRT_PADCTL_GPIO_EMC_00_OFFSET             0x0188
#define IMXRT_PADCTL_GPIO_EMC_01_OFFSET             0x018c
#define IMXRT_PADCTL_GPIO_EMC_02_OFFSET             0x0190
#define IMXRT_PADCTL_GPIO_EMC_03_OFFSET             0x0194
#define IMXRT_PADCTL_GPIO_EMC_04_OFFSET             0x0198
#define IMXRT_PADCTL_GPIO_EMC_05_OFFSET             0x019c
#define IMXRT_PADCTL_GPIO_EMC_06_OFFSET             0x01a0
#define IMXRT_PADCTL_GPIO_EMC_07_OFFSET             0x01a4
#define IMXRT_PADCTL_GPIO_EMC_08_OFFSET             0x01a8
#define IMXRT_PADCTL_GPIO_EMC_09_OFFSET             0x01ac
#define IMXRT_PADCTL_GPIO_EMC_10_OFFSET             0x01b0
#define IMXRT_PADCTL_GPIO_EMC_11_OFFSET             0x01b4
#define IMXRT_PADCTL_GPIO_EMC_12_OFFSET             0x01b8
#define IMXRT_PADCTL_GPIO_EMC_13_OFFSET             0x01bc
#define IMXRT_PADCTL_GPIO_EMC_14_OFFSET             0x01c0
#define IMXRT_PADCTL_GPIO_EMC_15_OFFSET             0x01c4
#define IMXRT_PADCTL_GPIO_EMC_16_OFFSET             0x01c8
#define IMXRT_PADCTL_GPIO_EMC_17_OFFSET             0x01cc
#define IMXRT_PADCTL_GPIO_EMC_18_OFFSET             0x01d0
#define IMXRT_PADCTL_GPIO_EMC_19_OFFSET             0x01d4
#define IMXRT_PADCTL_GPIO_EMC_20_OFFSET             0x01d8
#define IMXRT_PADCTL_GPIO_EMC_21_OFFSET             0x01dc
#define IMXRT_PADCTL_GPIO_EMC_22_OFFSET             0x01e0
#define IMXRT_PADCTL_GPIO_EMC_23_OFFSET             0x01e4
#define IMXRT_PADCTL_GPIO_EMC_24_OFFSET             0x01e8
#define IMXRT_PADCTL_GPIO_EMC_25_OFFSET             0x01ec
#define IMXRT_PADCTL_GPIO_EMC_26_OFFSET             0x01f0
#define IMXRT_PADCTL_GPIO_EMC_27_OFFSET             0x01f4
#define IMXRT_PADCTL_GPIO_EMC_28_OFFSET             0x01f8
#define IMXRT_PADCTL_GPIO_EMC_29_OFFSET             0x01fc
#define IMXRT_PADCTL_GPIO_EMC_30_OFFSET             0x0200
#define IMXRT_PADCTL_GPIO_EMC_31_OFFSET             0x0204
#define IMXRT_PADCTL_GPIO_EMC_32_OFFSET             0x0208
#define IMXRT_PADCTL_GPIO_EMC_33_OFFSET             0x020c
#define IMXRT_PADCTL_GPIO_EMC_34_OFFSET             0x0210
#define IMXRT_PADCTL_GPIO_EMC_35_OFFSET             0x0214
#define IMXRT_PADCTL_GPIO_EMC_36_OFFSET             0x0218
#define IMXRT_PADCTL_GPIO_EMC_37_OFFSET             0x021c
#define IMXRT_PADCTL_GPIO_EMC_38_OFFSET             0x0220
#define IMXRT_PADCTL_GPIO_EMC_39_OFFSET             0x0224
#define IMXRT_PADCTL_GPIO_EMC_40_OFFSET             0x0228
#define IMXRT_PADCTL_GPIO_EMC_41_OFFSET             0x022c
#define IMXRT_PADCTL_GPIO_AD_B0_00_OFFSET           0x0230
#define IMXRT_PADCTL_GPIO_AD_B0_01_OFFSET           0x0234
#define IMXRT_PADCTL_GPIO_AD_B0_02_OFFSET           0x0238
#define IMXRT_PADCTL_GPIO_AD_B0_03_OFFSET           0x023c
#define IMXRT_PADCTL_GPIO_AD_B0_04_OFFSET           0x0240
#define IMXRT_PADCTL_GPIO_AD_B0_05_OFFSET           0x0244
#define IMXRT_PADCTL_GPIO_AD_B0_06_OFFSET           0x0248
#define IMXRT_PADCTL_GPIO_AD_B0_07_OFFSET           0x024c
#define IMXRT_PADCTL_GPIO_AD_B0_08_OFFSET           0x0250
#define IMXRT_PADCTL_GPIO_AD_B0_09_OFFSET           0x0254
#define IMXRT_PADCTL_GPIO_AD_B0_10_OFFSET           0x0258
#define IMXRT_PADCTL_GPIO_AD_B0_11_OFFSET           0x025c
#define IMXRT_PADCTL_GPIO_AD_B0_12_OFFSET           0x0260
#define IMXRT_PADCTL_GPIO_AD_B0_13_OFFSET           0x0264
#define IMXRT_PADCTL_GPIO_AD_B0_14_OFFSET           0x0268
#define IMXRT_PADCTL_GPIO_AD_B0_15_OFFSET           0x026c
#define IMXRT_PADCTL_GPIO_AD_B1_00_OFFSET           0x0270
#define IMXRT_PADCTL_GPIO_AD_B1_01_OFFSET           0x0274
#define IMXRT_PADCTL_GPIO_AD_B1_02_OFFSET           0x0278
#define IMXRT_PADCTL_GPIO_AD_B1_03_OFFSET           0x027c
#define IMXRT_PADCTL_GPIO_AD_B1_04_OFFSET           0x0280
#define IMXRT_PADCTL_GPIO_AD_B1_05_OFFSET           0x0284
#define IMXRT_PADCTL_GPIO_AD_B1_06_OFFSET           0x0288
#define IMXRT_PADCTL_GPIO_AD_B1_07_OFFSET           0x028c
#define IMXRT_PADCTL_GPIO_AD_B1_08_OFFSET           0x0290
#define IMXRT_PADCTL_GPIO_AD_B1_09_OFFSET           0x0294
#define IMXRT_PADCTL_GPIO_AD_B1_10_OFFSET           0x0298
#define IMXRT_PADCTL_GPIO_AD_B1_11_OFFSET           0x029c
#define IMXRT_PADCTL_GPIO_AD_B1_12_OFFSET           0x02a0
#define IMXRT_PADCTL_GPIO_AD_B1_13_OFFSET           0x02a4
#define IMXRT_PADCTL_GPIO_AD_B1_14_OFFSET           0x02a8
#define IMXRT_PADCTL_GPIO_AD_B1_15_OFFSET           0x02ac
#define IMXRT_PADCTL_GPIO_SD_B0_00_OFFSET           0x02b0
#define IMXRT_PADCTL_GPIO_SD_B0_01_OFFSET           0x02b4
#define IMXRT_PADCTL_GPIO_SD_B0_02_OFFSET           0x02b8
#define IMXRT_PADCTL_GPIO_SD_B0_03_OFFSET           0x02bc
#define IMXRT_PADCTL_GPIO_SD_B0_04_OFFSET           0x02c0
#define IMXRT_PADCTL_GPIO_SD_B0_05_OFFSET           0x02c4
#define IMXRT_PADCTL_GPIO_SD_B0_06_OFFSET           0x02c8
#define IMXRT_PADCTL_GPIO_SD_B1_00_OFFSET           0x02cc
#define IMXRT_PADCTL_GPIO_SD_B1_01_OFFSET           0x02d0
#define IMXRT_PADCTL_GPIO_SD_B1_02_OFFSET           0x02d4
#define IMXRT_PADCTL_GPIO_SD_B1_03_OFFSET           0x02d8
#define IMXRT_PADCTL_GPIO_SD_B1_04_OFFSET           0x02dc
#define IMXRT_PADCTL_GPIO_SD_B1_05_OFFSET           0x02e0
#define IMXRT_PADCTL_GPIO_SD_B1_06_OFFSET           0x02e4
#define IMXRT_PADCTL_GPIO_SD_B1_07_OFFSET           0x02e8
#define IMXRT_PADCTL_GPIO_SD_B1_08_OFFSET           0x02ec
#define IMXRT_PADCTL_GPIO_SD_B1_09_OFFSET           0x02f0
#define IMXRT_PADCTL_GPIO_SD_B1_10_OFFSET           0x02f4
#define IMXRT_PADCTL_GPIO_SD_B1_11_OFFSET           0x02f8

/* Select Input Daisy Register Offsets */

