apache/nuttx/arch/arm/src/imxrt/chip/rt102x/imxrt102x_iomuxc.h
#define IMXRT_INPUT_INDEX2OFFSET(n)                 (0x02fc + ((unsigned int)(n) << 2))
#define IMXRT_INPUT_OFFSET2INDEX(o)                 (((unsigned int)(o) - 0x02fc) >> 2)

#define IMXRT_INPUT_ANATOP_USB_OTG1_ID_OFFSET       0x02fc
#define IMXRT_INPUT_CCM_PMIC_READY_OFFSET           0x0300
#define IMXRT_INPUT_ENET_IPG_CLK_RMII_OFFSET        0x0304
#define IMXRT_INPUT_ENET_MDIO_OFFSET                0x0308
#define IMXRT_INPUT_ENET_RXDATA0_OFFSET             0x030c
#define IMXRT_INPUT_ENET_RXDATA1_OFFSET             0x0310
#define IMXRT_INPUT_ENET_RXEN_OFFSET                0x0314
#define IMXRT_INPUT_ENET_RXERR_OFFSET               0x0318
#define IMXRT_INPUT_ENET_TXCLK_OFFSET               0x031c
#define IMXRT_INPUT_FLEXCAN1_RX_OFFSET              0x0320
#define IMXRT_INPUT_FLEXCAN2_RX_OFFSET              0x0324
#define IMXRT_INPUT_FLEXPWM1_PWMA0_OFFSET           0x0328
#define IMXRT_INPUT_FLEXPWM1_PWMA1_OFFSET           0x032c
#define IMXRT_INPUT_FLEXPWM1_PWMA2_OFFSET           0x0330
#define IMXRT_INPUT_FLEXPWM1_PWMA3_OFFSET           0x0334
#define IMXRT_INPUT_FLEXPWM1_PWMB0_OFFSET           0x0338
#define IMXRT_INPUT_FLEXPWM1_PWMB1_OFFSET           0x033c
#define IMXRT_INPUT_FLEXPWM1_PWMB2_OFFSET           0x0340
#define IMXRT_INPUT_FLEXPWM1_PWMB3_OFFSET           0x0344
#define IMXRT_INPUT_FLEXPWM2_PWMA0_OFFSET           0x0348
#define IMXRT_INPUT_FLEXPWM2_PWMA1_OFFSET           0x034c
#define IMXRT_INPUT_FLEXPWM2_PWMA2_OFFSET           0x0350
#define IMXRT_INPUT_FLEXPWM2_PWMA3_OFFSET           0x0354
#define IMXRT_INPUT_FLEXPWM2_PWMB0_OFFSET           0x0358
#define IMXRT_INPUT_FLEXPWM2_PWMB1_OFFSET           0x035c
#define IMXRT_INPUT_FLEXPWM2_PWMB2_OFFSET           0x0360
#define IMXRT_INPUT_FLEXPWM2_PWMB3_OFFSET           0x0364
#define IMXRT_INPUT_FLEXSPIA_DATA0_OFFSET           0x0368
#define IMXRT_INPUT_FLEXSPIA_DATA1_OFFSET           0x036c
#define IMXRT_INPUT_FLEXSPIA_DATA2_OFFSET           0x0370
#define IMXRT_INPUT_FLEXSPIA_DATA3_OFFSET           0x0374
#define IMXRT_INPUT_FLEXSPIA_SCK_OFFSET             0x0378
#define IMXRT_INPUT_LPI2C1_SCL_OFFSET               0x037c
#define IMXRT_INPUT_LPI2C1_SDA_OFFSET               0x0380
#define IMXRT_INPUT_LPI2C2_SCL_OFFSET               0x0384
#define IMXRT_INPUT_LPI2C2_SDA_OFFSET               0x0388
#define IMXRT_INPUT_LPI2C3_SCL_OFFSET               0x038c
#define IMXRT_INPUT_LPI2C3_SDA_OFFSET               0x0390
#define IMXRT_INPUT_LPI2C4_SCL_OFFSET               0x0394
#define IMXRT_INPUT_LPI2C4_SDA_OFFSET               0x0398
#define IMXRT_INPUT_LPSPI1_PCS0_OFFSET              0x039c
#define IMXRT_INPUT_LPSPI1_SCK_OFFSET               0x03a0
#define IMXRT_INPUT_LPSPI1_SDI_OFFSET               0x03a4
#define IMXRT_INPUT_LPSPI1_SDO_OFFSET               0x03a8
#define IMXRT_INPUT_LPSPI2_PCS0_OFFSET              0x03ac
#define IMXRT_INPUT_LPSPI2_SCK_OFFSET               0x03b0
#define IMXRT_INPUT_LPSPI2_SDI_OFFSET               0x03b4
#define IMXRT_INPUT_LPSPI2_SDO_OFFSET               0x03b8
#define IMXRT_INPUT_LPSPI4_PCS0_OFFSET              0x03bc
#define IMXRT_INPUT_LPSPI4_SCK_OFFSET               0x03c0
#define IMXRT_INPUT_LPSPI4_SDI_OFFSET               0x03c4
#define IMXRT_INPUT_LPSPI4_SDO_OFFSET               0x03c8
#define IMXRT_INPUT_LPUART3_CTS_B_OFFSET            0x03cc
#define IMXRT_INPUT_LPUART2_RX_OFFSET               0x03d0
#define IMXRT_INPUT_LPUART2_TX_OFFSET               0x03d4
#define IMXRT_INPUT_LPUART3_RX_OFFSET               0x03d8
#define IMXRT_INPUT_LPUART3_TX_OFFSET               0x03dc
#define IMXRT_INPUT_LPUART4_CTS_B_OFFSET            0x03e0
#define IMXRT_INPUT_LPUART4_RX_OFFSET               0x03e4
#define IMXRT_INPUT_LPUART4_TX_OFFSET               0x03e8
#define IMXRT_INPUT_LPUART5_RX_OFFSET               0x03ec
#define IMXRT_INPUT_LPUART5_TX_OFFSET               0x03f0
#define IMXRT_INPUT_LPUART6_RX_OFFSET               0x03f4
#define IMXRT_INPUT_LPUART6_TX_OFFSET               0x03f8
#define IMXRT_INPUT_LPUART7_RX_OFFSET               0x03fc
#define IMXRT_INPUT_LPUART7_TX_OFFSET               0x0400
#define IMXRT_INPUT_LPUART8_RX_OFFSET               0x0404
#define IMXRT_INPUT_LPUART8_TX_OFFSET               0x0408
#define IMXRT_INPUT_NMI_GLUE_NMI_OFFSET             0x040c
#define IMXRT_INPUT_QTIMER1_TIMER0_OFFSET           0x0410
#define IMXRT_INPUT_QTIMER1_TIMER1_OFFSET           0x0414
#define IMXRT_INPUT_QTIMER1_TIMER2_OFFSET           0x0418
#define IMXRT_INPUT_QTIMER1_TIMER3_OFFSET           0x041c
#define IMXRT_INPUT_QTIMER2_TIMER0_OFFSET           0x0420
#define IMXRT_INPUT_QTIMER2_TIMER1_OFFSET           0x0424
#define IMXRT_INPUT_QTIMER2_TIMER2_OFFSET           0x0428
#define IMXRT_INPUT_QTIMER2_TIMER3_OFFSET           0x042c
#define IMXRT_INPUT_SAI1_MCLK_OFFSET                0x0430
#define IMXRT_INPUT_SAI1_RX_BCLK_OFFSET             0x0434
#define IMXRT_INPUT_SAI1_RX_DATA0_OFFSET            0x0438
#define IMXRT_INPUT_SAI1_RX_DATA1_OFFSET            0x043c
#define IMXRT_INPUT_SAI1_RX_DATA2_OFFSET            0x0440
#define IMXRT_INPUT_SAI1_RX_DATA3_OFFSET            0x0444
#define IMXRT_INPUT_SAI1_RX_SYNC_OFFSET             0x0448
#define IMXRT_INPUT_SAI1_TX_BCLK_OFFSET             0x044c
#define IMXRT_INPUT_SAI1_TX_SYNC_OFFSET             0x0450
#define IMXRT_INPUT_SAI2_MCLK_OFFSET                0x0454
#define IMXRT_INPUT_SAI2_RX_BCLK_OFFSET             0x0458
#define IMXRT_INPUT_SAI2_RX_DATA0_OFFSET            0x045c
#define IMXRT_INPUT_SAI2_RX_SYNC_OFFSET             0x0460
#define IMXRT_INPUT_SAI2_TX_BCLK_OFFSET             0x0464
#define IMXRT_INPUT_SAI2_TX_SYNC_OFFSET             0x0468
#define IMXRT_INPUT_SAI3_MCLK_OFFSET                0x046c
#define IMXRT_INPUT_SAI3_RX_BCLK_OFFSET             0x0470
#define IMXRT_INPUT_SAI3_RX_DATA0_OFFSET            0x0474
#define IMXRT_INPUT_SAI3_RX_SYNC_OFFSET             0x0478
#define IMXRT_INPUT_SAI3_TX_BCLK_OFFSET             0x047c
#define IMXRT_INPUT_SAI3_TX_SYNC_OFFSET             0x0480
#define IMXRT_INPUT_SEMC_READY_OFFSET               0x0484
#define IMXRT_INPUT_SPDIF_IN_OFFSET                 0x0488
#define IMXRT_INPUT_USB_OTG1_OC_OFFSET              0x048c
#define IMXRT_INPUT_USDHC1_CD_B_OFFSET              0x0490
#define IMXRT_INPUT_USDHC1_WP_OFFSET                0x0494
#define IMXRT_INPUT_USDHC2_CD_B_OFFSET              0x0498
#define IMXRT_INPUT_USDHC2_CMD_OFFSET               0x049c
#define IMXRT_INPUT_XBAR1_IN14_OFFSET               0x04a0
#define IMXRT_INPUT_XBAR1_IN15_OFFSET               0x04a4
#define IMXRT_INPUT_XBAR1_IN16_OFFSET               0x04a8
#define IMXRT_INPUT_XBAR1_IN17_OFFSET               0x04ac
#define IMXRT_INPUT_XBAR1_IN10_OFFSET               0x04b0
#define IMXRT_INPUT_XBAR1_IN12_OFFSET               0x04b4
#define IMXRT_INPUT_XBAR1_IN13_OFFSET               0x04b8
#define IMXRT_INPUT_XBAR1_IN18_OFFSET               0x04bc
#define IMXRT_INPUT_XBAR1_IN19_OFFSET               0x04c0

/* Register addresses ********************************************************/

